Repository: maxyprint/yprint_p4ym3nt
Catalog: yprint_payment/languages/yprint-payment-*.po
Languages: de_de

source: Custom payment system for YPrint with advanced Stripe and PayPal integration
de_de: Benutzerdefiniertes Zahlungssystem für YPrint mit erweiterter Stripe- und PayPal-Integration

source: This plugin requires WooCommerce to function. Please install and activate WooCommerce.
de_de: Dieses Plugin benötigt WooCommerce, um zu funktionieren. Bitte installieren und aktivieren Sie WooCommerce.

source: YPrint Payment requires WooCommerce to function. Please install and activate WooCommerce.
de_de: YPrint Payment benötigt WooCommerce, um zu funktionieren. Bitte installieren und aktivieren Sie WooCommerce.

source: General
de_de: Allgemein

source: General Settings
de_de: Allgemeine Einstellungen

source: Used in emails and payment pages.
de_de: Wird in E-Mails und auf Zahlungsseiten angezeigt.

source: Thank You Page
de_de: Danke-Seite

source: Use default thank you page
de_de: Standard-Dankeseite verwenden

source: Page that customer is redirected to after successful payment.
de_de: Seite, auf die der Kunde nach erfolgreicher Zahlung weitergeleitet wird.

source: View page
de_de: Seite anzeigen

source: Debug Mode
de_de: Debug-Modus

source: Enable debug mode
de_de: Debug-Modus aktivieren

source: Enables detailed logging and debug information.
de_de: Aktiviert detaillierte Protokollierung und Debug-Informationen.

source: Log Retention
de_de: Log-Aufbewahrung

source: 7 days
de_de: 7 Tage

source: 14 days
de_de: 14 Tage

source: 30 days
de_de: 30 Tage

source: 60 days
de_de: 60 Tage

source: 90 days
de_de: 90 Tage

source: Period for which logs should be retained.
de_de: Zeitraum, für den Protokolle aufbewahrt werden sollen.

source: Save Settings
de_de: Einstellungen speichern

source: Stripe Settings
de_de: Stripe-Einstellungen

source: Stripe is a secure payment platform that enables credit and debit card payments. You need a Stripe account to enable this payment method.
de_de: Stripe ist eine sichere Zahlungsplattform, die Kredit- und Debitkartenzahlungen ermöglicht. Du benötigst ein Stripe-Konto, um diese Zahlungsmethode zu aktivieren.

source: Learn more about Stripe
de_de: Mehr über Stripe erfahren

source: Enable Stripe
de_de: Stripe aktivieren

source: Enable Stripe as payment method
de_de: Stripe als Zahlungsmethode aktivieren

source: Test Mode
de_de: Testmodus

source: Enable test mode
de_de: Testmodus aktivieren

source: In test mode, no real payments are processed. Use test card data for testing.
de_de: Im Testmodus werden keine echten Zahlungen verarbeitet. Verwende Testeinkaufsdaten zum Testen.

source: Production Keys (Live)
de_de: Produktionsschlüssel (Live)

source: Public Key
de_de: Öffentlicher Schlüssel

source: Starts with "pk_live_".
de_de: Beginnt mit "pk_live_".

source: Secret Key
de_de: Geheimer Schlüssel

source: Starts with "sk_live_".
de_de: Beginnt mit "sk_live_".

source: Starts with "whsec_".
de_de: Beginnt mit "whsec_".

source: Test Keys
de_de: Testschlüssel

source: Test Public Key
de_de: Test-Öffentlicher Schlüssel

source: Starts with "pk_test_".
de_de: Beginnt mit "pk_test_".

source: Test Secret Key
de_de: Test-Geheimer Schlüssel

source: Starts with "sk_test_".
de_de: Beginnt mit "sk_test_".

source: Test Connection
de_de: Verbindung testen

source: Test Stripe Connection
de_de: Verbindung zu Stripe testen

source: Add this URL in your Stripe dashboard under Developers → Webhooks.
de_de: Füge diese URL in deinem Stripe-Dashboard unter Entwickler → Webhooks hinzu.

source: Create Webhook Automatically
de_de: Webhook automatisch erstellen

source: Stripe Checkout Settings
de_de: Stripe Checkout-Einstellungen

source: SCA Support
de_de: SCA-Unterstützung

source: Enable Strong Customer Authentication (SCA)
de_de: Starke Kundenauthentifizierung (SCA) aktivieren

source: Required for merchants in the EU. Enables 3D Secure and other authentication methods.
de_de: Erforderlich für Händler in der EU. Aktiviert 3D Secure und andere Authentifizierungsmethoden.

source: Payment Title
de_de: Zahlungstitel

source: Title shown to customers.
de_de: Der Titel, der den Kunden angezeigt wird.

source: Payment Description
de_de: Zahlungsbeschreibung

source: Pay securely with your credit or debit card.
de_de: Bezahlen Sie sicher mit Ihrer Kredit- oder Debitkarte.

source: Description shown to customers.
de_de: Die Beschreibung, die den Kunden angezeigt wird.

source: Save Stripe Settings
de_de: Stripe-Einstellungen speichern

source: PayPal Settings
de_de: PayPal-Einstellungen

source: PayPal allows your customers to pay with their PayPal account or by credit card. You need a PayPal Business account to enable this payment method.
de_de: PayPal ermöglicht es deinen Kunden, mit ihrem PayPal-Konto oder per Kreditkarte zu bezahlen. Du benötigst ein PayPal-Geschäftskonto, um diese Zahlungsmethode zu aktivieren.

source: Learn more about PayPal
de_de: Mehr über PayPal erfahren

source: Enable PayPal
de_de: PayPal aktivieren

source: Enable PayPal as payment method
de_de: PayPal als Zahlungsmethode aktivieren

source: Enable test mode (Sandbox)
de_de: Testmodus aktivieren (Sandbox)

source: In test mode, no real payments are processed. Use PayPal Sandbox data for testing.
de_de: Im Testmodus werden keine echten Zahlungen verarbeitet. Verwende PayPal-Sandboxdaten zum Testen.

source: Test Keys (Sandbox)
de_de: Testschlüssel (Sandbox)

source: Test PayPal Connection
de_de: Verbindung zu PayPal testen

source: Add this URL in your PayPal dashboard under Settings → Webhook settings.
de_de: Füge diese URL in deinem PayPal-Dashboard unter Einstellungen → Webhook-Einstellungen hinzu.

source: PayPal Checkout Settings
de_de: PayPal Checkout-Einstellungen

source: Enable PayPal Smart Payment Buttons
de_de: PayPal Smart Payment Buttons aktivieren

source: Modern, customizable PayPal buttons for a better checkout experience.
de_de: Moderne, anpassbare PayPal-Buttons für ein besseres Checkout-Erlebnis.

source: Pay quickly and securely with your PayPal account.
de_de: Bezahlen Sie schnell und sicher mit Ihrem PayPal-Konto.

source: Save PayPal Settings
de_de: PayPal-Einstellungen speichern

source: SEPA Settings
de_de: SEPA-Einstellungen

source: SEPA (Single Euro Payments Area) allows your customers to pay via direct debit. This payment method is mainly available in Europe.
de_de: SEPA (Single Euro Payments Area) ermöglicht es deinen Kunden, per Lastschrift zu bezahlen. Diese Zahlungsmethode ist hauptsächlich in Europa verfügbar.

source: Enable SEPA
de_de: SEPA aktivieren

source: Enable SEPA Direct Debit as payment method
de_de: SEPA-Lastschrift als Zahlungsmethode aktivieren

source: In test mode, no real payments are processed.
de_de: Im Testmodus werden keine echten Zahlungen verarbeitet.

source: API Key
de_de: API-Schlüssel

source: Creditor ID
de_de: Gläubiger-ID

source: Your SEPA creditor ID (e.g. DE98ZZZ09999999999).
de_de: Deine SEPA-Gläubiger-ID (z.B. DE98ZZZ09999999999).

source: Company Name
de_de: Firmenname

source: Your company name for SEPA mandates.
de_de: Name deines Unternehmens für SEPA-Mandate.

source: SEPA Checkout Settings
de_de: SEPA-Checkout-Einstellungen

source: Mandate Type
de_de: Mandatstyp

source: One-off
de_de: Einmalig

source: Recurring
de_de: Wiederkehrend

source: Type of SEPA mandate.
de_de: Art des SEPA-Mandats.

source: Mandate Text
de_de: Mandatstext

source: I authorize {company} to collect payments from my account via SEPA Direct Debit. At the same time, I instruct my bank to honor the direct debits drawn by {company} on my account. Note: I can request a refund of the debited amount within eight weeks, starting from the debit date. The terms and conditions agreed with my bank apply.
de_de: Ich ermächtige {company}, Zahlungen von meinem Konto mittels SEPA-Lastschrift einzuziehen. Zugleich weise ich mein Kreditinstitut an, die von {company} auf mein Konto gezogenen Lastschriften einzulösen. Hinweis: Ich kann innerhalb von acht Wochen, beginnend mit dem Belastungsdatum, die Erstattung des belasteten Betrages verlangen. Es gelten dabei die mit meinem Kreditinstitut vereinbarten Bedingungen.

source: Text shown to customers. Use {company} as placeholder for your company name.
de_de: Der Text, der dem Kunden angezeigt wird. Verwende {company} als Platzhalter für deinen Firmennamen.

source: Pay conveniently via direct debit from your bank account.
de_de: Bezahlen Sie bequem per Lastschrift von Ihrem Bankkonto.

source: Save SEPA Settings
de_de: SEPA-Einstellungen speichern

source: Bank Transfer
de_de: Banküberweisung

source: Bank Transfer Settings
de_de: Banküberweisung-Einstellungen

source: Bank transfer allows your customers to transfer money directly to your bank account. The order is processed after payment is received.
de_de: Die Banküberweisung ermöglicht es deinen Kunden, direkt auf dein Bankkonto zu überweisen. Die Bestellung wird erst nach Zahlungseingang bearbeitet.

source: Enable Bank Transfer
de_de: Banküberweisung aktivieren

source: Enable Bank Transfer as payment method
de_de: Banküberweisung als Zahlungsmethode aktivieren

source: Account Holder
de_de: Kontoinhaber

source: Payment Instructions
de_de: Zahlungsanweisungen

source: Please transfer the amount to the following account. Use your order number as reference so we can assign your payment.
de_de: Bitte überweisen Sie den Betrag auf das folgende Konto. Verwenden Sie Ihre Bestellnummer als Verwendungszweck, damit wir Ihre Zahlung zuordnen können.

source: Instructions for customers on how to complete the transfer.
de_de: Anweisungen für die Kunden, wie sie die Überweisung durchführen sollen.

source: Pay via bank transfer. Your order will be processed after payment is received.
de_de: Bezahlen Sie per Banküberweisung. Ihre Bestellung wird nach Zahlungseingang bearbeitet.

source: Save Bank Transfer Settings
de_de: Banküberweisung-Einstellungen speichern

source: Webhooks allow payment providers to communicate with your shop and send payment status updates.
de_de: Webhooks ermöglichen es Zahlungsanbietern, mit deinem Shop zu kommunizieren und Zahlungsstatusaktualisierungen zu senden.

source: Feature Flags allow you to enable or disable specific features.
de_de: Feature-Flags ermöglichen es, bestimmte Funktionen gezielt zu aktivieren oder zu deaktivieren.

source: Reset to Default Values
de_de: Zurücksetzen auf Standardwerte

source: Plugin Information
de_de: Plugin-Informationen

source: Clear Plugin Cache
de_de: Plugin-Cache leeren

source: Run Diagnostics
de_de: Diagnose ausführen

source: Log Files
de_de: Log-Dateien

source: No log files found.
de_de: Keine Log-Dateien gefunden.

source: Available Logs
de_de: Verfügbare Logs

source: Delete
de_de: Löschen

source: Download
de_de: Herunterladen

source: Refresh
de_de: Aktualisieren

source: Select a log file from the list to view its contents.
de_de: Wähle eine Log-Datei aus der Liste aus, um den Inhalt anzuzeigen.

source: Log Settings
de_de: Log-Einstellungen

source: Errors (minimal)
de_de: Fehler (minimal)

source: Warnings
de_de: Warnungen

source: Info
de_de: Infos

source: Debug (verbose)
de_de: Debug (ausführlich)

source: Higher log levels record more information.
de_de: Je höher der Log-Level, desto mehr Informationen werden protokolliert.

source: Save Log Settings
de_de: Log-Einstellungen speichern

source: Delete All Logs
de_de: Alle Logs löschen

source: Payment Methods
de_de: Zahlungsmethoden

source: Select a payment method
de_de: Wähle eine Zahlungsmethode

source: Shipping Address
de_de: Lieferadresse

source: First Name
de_de: Vorname

source: Last Name
de_de: Nachname

source: Street Address
de_de: Straße und Hausnummer

source: Apartment, suite, unit, etc. (optional)
de_de: Zusatz, Wohnung, Etage etc. (optional)

source: Postcode / ZIP
de_de: Postleitzahl

source: Town / City
de_de: Stadt

source: Country
de_de: Land

source: Phone
de_de: Telefon

source: Email Address
de_de: E-Mail-Adresse

source: Different Billing Address
de_de: Abweichende Rechnungsadresse

source: Use a different billing address
de_de: Verwende eine abweichende Rechnungsadresse

source: Billing Address
de_de: Rechnungsadresse

source: Order Summary
de_de: Bestellübersicht

source: Product
de_de: Produkt

source: Price
de_de: Preis

source: Quantity
de_de: Menge

source: Subtotal
de_de: Zwischensumme

source: Remove
de_de: Entfernen

source: Your cart is empty.
de_de: Dein Warenkorb ist leer.

source: Shipping
de_de: Versand

source: Tax
de_de: Steuer

source: Discount
de_de: Rabatt

source: Total
de_de: Gesamtsumme

source: Have a coupon?
de_de: Hast du einen Gutschein?

source: Coupon code
de_de: Gutscheincode

source: Apply
de_de: Anwenden

source: I have read and agree to the website's privacy policy.
de_de: Ich habe die Datenschutzerklärung der Website gelesen und stimme ihr zu.

source: Buy Now
de_de: Jetzt kaufen

source: Payment cancelled
de_de: Zahlung abgebrochen

source: The PayPal payment was cancelled. Please try again or choose another payment method.
de_de: Die PayPal-Zahlung wurde abgebrochen. Bitte versuche es erneut oder wähle eine andere Zahlungsmethode.

source: Back to Checkout
de_de: Zurück zum Checkout

source: Processing payment
de_de: Zahlung wird verarbeitet

source: Your PayPal payment is being processed. Please wait a moment...
de_de: Ihre PayPal-Zahlung wird verarbeitet. Bitte warten Sie einen Moment...

source: Payment successful
de_de: Zahlung erfolgreich

source: Your payment was successfully processed. You will be redirected shortly...
de_de: Ihre Zahlung wurde erfolgreich verarbeitet. Sie werden in Kürze weitergeleitet...

source: Payment not completed
de_de: Zahlung nicht abgeschlossen

source: There was an error processing your payment.
de_de: Bei der Verarbeitung Ihrer Zahlung ist ein Fehler aufgetreten.

source: Thank you for your order!
de_de: Vielen Dank für Ihre Bestellung!

source: Your order has been received and is now being processed.
de_de: Ihre Bestellung wurde erhalten und wird nun bearbeitet.

source: Order Details
de_de: Bestelldetails

source: Order Number:
de_de: Bestellnummer:

source: Date:
de_de: Datum:

source: Total:
de_de: Gesamtsumme:

source: Payment Method:
de_de: Zahlungsmethode:

source: We've sent you an email with your order details and confirmation.
de_de: Wir haben Ihnen eine E-Mail mit Ihren Bestelldaten und der Bestätigung gesendet.

source: Continue Shopping
de_de: Weiter einkaufen

source: Order at
de_de: Bestellung bei

source: Payment via Stripe confirmed (Charge ID: %s)
de_de: Zahlung über Stripe bestätigt (Charge ID: %s)

source: Stripe payment failed: %s
de_de: Stripe-Zahlung fehlgeschlagen: %s

source: Stripe payment fully refunded.
de_de: Stripe-Zahlung vollständig zurückerstattet.

source: Stripe payment partially refunded: %s of %s
de_de: Stripe-Zahlung teilweise zurückerstattet: %s von %s

source: Stripe partial refund (Webhook)
de_de: Stripe Teilrückerstattung (Webhook)

source: Payment requires further authentication
de_de: Zahlung erfordert weitere Authentifizierung

source: Payment was not successfully completed (Status: %s)
de_de: Zahlung wurde nicht erfolgreich abgeschlossen (Status: %s)

source: Payment via PayPal confirmed (Transaction ID: %s)
de_de: Zahlung über PayPal bestätigt (Transaktions-ID: %s)

source: PayPal payment was refunded.
de_de: PayPal-Zahlung wurde zurückerstattet.

source: PayPal order approved, waiting for payment completion
de_de: PayPal-Bestellung genehmigt, warten auf Zahlungsabschluss

source: Order cannot be found for PayPal order ID: %s
de_de: Bestellung kann für PayPal-Bestellnummer nicht gefunden werden: %s

source: SEPA mandate issued: %s
de_de: SEPA-Lastschriftmandat erteilt: %s

source: Hello %s %s, Thank you for your order with %s. You have granted us a SEPA direct debit mandate. Here are the details: Mandate reference: %s IBAN: %s Account holder: %s Amount: %s Date: %s The amount will be debited from your account in the next few days. Kind regards, Your %s Team
de_de: Hallo %s %s, Vielen Dank für Ihre Bestellung bei %s. Sie haben uns ein SEPA-Lastschriftmandat erteilt. Hier sind die Details: Mandatsreferenz: %s IBAN: %s Kontoinhaber: %s Betrag: %s Datum: %s Der Betrag wird in den nächsten Tagen von Ihrem Konto abgebucht. Mit freundlichen Grüßen Ihr %s Team

source: SEPA Mandate Confirmation
de_de: SEPA-Mandatsbestätigung

source: Awaiting bank transfer. Please use these details for payment: Amount: %s Account Holder: %s Bank: %s IBAN: %s BIC: %s Reference: Order #%s
de_de: Warten auf Banküberweisung. Bitte verwenden Sie diese Daten für die Zahlung: Betrag: %s Kontoinhaber: %s Bank: %s IBAN: %s BIC: %s Verwendungszweck: Bestellung #%s

source: Payment pending
de_de: Zahlung ausstehend

source: Order created from YPrint Payment checkout
de_de: Bestellung über YPrint Payment Checkout erstellt

source: Credit Card
de_de: Kreditkarte

source: SEPA Direct Debit
de_de: SEPA-Lastschrift

source: Unknown payment method
de_de: Unbekannte Zahlungsmethode

source: Enables Stripe payment gateway
de_de: Aktiviert Stripe als Zahlungsmethode

source: Enables Strong Customer Authentication (SCA) for EU payments
de_de: Aktiviert die Starke Kundenauthentifizierung (SCA) für EU-Zahlungen

source: Enables the Unified Payment Element (new Stripe UI)
de_de: Aktiviert das Unified Payment Element (neue Stripe-UI)

source: Enables webhook support for Stripe
de_de: Aktiviert Webhook-Unterstützung für Stripe

source: Enables PayPal payment gateway
de_de: Aktiviert PayPal als Zahlungsmethode

source: Enables Smart Payment Buttons for PayPal
de_de: Aktiviert Smart Payment Buttons für PayPal

source: Enables webhook support for PayPal
de_de: Aktiviert Webhook-Unterstützung für PayPal

source: Enables SEPA Direct Debit payment method
de_de: Aktiviert die SEPA-Lastschrift-Zahlungsmethode

source: Enables instant IBAN validation
de_de: Aktiviert sofortige IBAN-Validierung

source: Enables Bank Transfer payment method
de_de: Aktiviert die Banküberweisung-Zahlungsmethode

source: Enables Klarna payment method (future)
de_de: Aktiviert die Klarna-Zahlungsmethode (zukünftig)

source: Enables Sofort payment method (future)
de_de: Aktiviert die Sofort-Zahlungsmethode (zukünftig)

source: Enables responsive checkout
de_de: Aktiviert den responsiven Checkout

source: Enables enhanced form validation
de_de: Aktiviert verbesserte Formularvalidierung

source: Enables address autofill
de_de: Aktiviert die automatische Adressvervollständigung

source: Enables advanced reporting
de_de: Aktiviert erweiterte Berichterstellung

source: Enables transaction logs
de_de: Aktiviert Transaktionsprotokolle

source: Enables debug mode with detailed logging
de_de: Aktiviert den Debug-Modus mit ausführlicher Protokollierung

source: Enables fraud detection
de_de: Aktiviert Betrugserkennung

source: Enables CAPTCHA protection for checkout
de_de: Aktiviert CAPTCHA-Schutz für Checkout

source: Enables AJAX cart updates
de_de: Aktiviert AJAX-Warenkorb-Updates

source: Enables lazy loading of resources
de_de: Aktiviert Lazy Loading von Ressourcen

source: API Error: %s - %s
de_de: API-Fehler: %s - %s

source: Unknown error
de_de: Unbekannter Fehler

source: An error occurred while communicating with the payment provider.
de_de: Ein Fehler ist bei der Kommunikation mit dem Zahlungsdienstleister aufgetreten.

source: Please provide a complete shipping address
de_de: Bitte gib eine vollständige Lieferadresse an

source: Please select a payment method
de_de: Bitte wähle eine Zahlungsmethode aus

source: Please provide a complete billing address
de_de: Bitte gib eine vollständige abweichende Rechnungsadresse an

source: Please accept the privacy policy
de_de: Bitte akzeptiere die Datenschutzerklärung

source: Please enter a coupon code.
de_de: Bitte gib einen Gutschein-Code ein.

source: Coupon successfully applied.
de_de: Gutschein wurde erfolgreich angewendet.

source: Coupon could not be applied.
de_de: Gutschein konnte nicht angewendet werden.

source: An error occurred. Please try again.
de_de: Ein Fehler ist aufgetreten. Bitte versuche es erneut.

source: Connection error while preparing order
de_de: Verbindungsfehler bei der Vorbereitung der Bestellung

source: Unknown payment method:
de_de: Unbekannte Zahlungsmethode:

source: Payment gateway not initialized:
de_de: Zahlungs-Gateway nicht initialisiert:

source: Connection error while finalizing order
de_de: Verbindungsfehler bei der Finalisierung der Bestellung

source: Stripe not initialized
de_de: Stripe nicht initialisiert

source: Stripe initialization failed
de_de: Stripe-Initialisierung fehlgeschlagen

source: Connection error initializing payment
de_de: Verbindungsfehler bei der Zahlungsinitialisierung

source: PayPal payment cancelled
de_de: PayPal-Zahlung wurde abgebrochen

source: PayPal payment error:
de_de: Fehler bei der PayPal-Zahlung:

source: Error loading PayPal:
de_de: Fehler beim Laden von PayPal:

source: Please enter a valid IBAN
de_de: Bitte gib eine gültige IBAN ein

source: Please enter the account holder name
de_de: Bitte gib den Namen des Kontoinhabers an

source: SEPA payment could not be processed.
de_de: SEPA-Zahlung konnte nicht verarbeitet werden.

source: Error processing SEPA payment.
de_de: Fehler bei der SEPA-Zahlungsverarbeitung.
